FreeRTOS/FreeRTOS/FreeRTOS/Demo/RL78_E2Studio_GCC/src/iodefine_RL78L13.h
/*
 Sfr bits
 */
#define ADCE ADM0_bit.no0
#define ADCS ADM0_bit.no7
#define LCDVLM LCDM1_bit.no0
#define LCDSEL LCDM1_bit.no3
#define BLON LCDM1_bit.no4
#define VLCON LCDM1_bit.no5
#define SCOC LCDM1_bit.no6
#define LCDON LCDM1_bit.no7
#define OPTCKE MLCD_bit.no4
#define COMEXP MLCD_bit.no6
#define MLCDEN MLCD_bit.no7
#define SPD0 IICS0_bit.no0
#define STD0 IICS0_bit.no1
#define ACKD0 IICS0_bit.no2
#define TRC0 IICS0_bit.no3
#define COI0 IICS0_bit.no4
#define EXC0 IICS0_bit.no5
#define ALD0 IICS0_bit.no6
#define MSTS0 IICS0_bit.no7
#define IICRSV0 IICF0_bit.no0
#define STCEN0 IICF0_bit.no1
#define IICBSY0 IICF0_bit.no6
#define STCF0 IICF0_bit.no7
#define FSSTP FSSQ_bit.no6
#define SQST FSSQ_bit.no7
#define SQEND FSASTH_bit.no6
#define ESQEND FSASTH_bit.no7
#define RCLOE1 RTCC0_bit.no5
#define RCLOSEL RTCC0_bit.no6
#define RTCE RTCC0_bit.no7
#define RWAIT RTCC1_bit.no0
#define RWST RTCC1_bit.no1
#define RIFG RTCC1_bit.no3
#define WAFG RTCC1_bit.no4
#define RITE RTCC1_bit.no5
#define WALIE RTCC1_bit.no6
#define WALE RTCC1_bit.no7
#define HIOSTOP CSC_bit.no0
#define XTSTOP CSC_bit.no6
#define MSTOP CSC_bit.no7
#define SDIV CKC_bit.no3
#define MCM0 CKC_bit.no4
#define MCS CKC_bit.no5
#define CSS CKC_bit.no6
#define CLS CKC_bit.no7
#define PCLOE0 CKS0_bit.no7
#define PCLOE1 CKS1_bit.no7
#define LVIF LVIM_bit.no0
#define LVIOMSK LVIM_bit.no1
#define LVISEN LVIM_bit.no7
#define LVILV LVIS_bit.no0
#define LVIMD LVIS_bit.no7
#define DWAIT0 DMC0_bit.no4
#define DS0 DMC0_bit.no5
#define DRS0 DMC0_bit.no6
#define STG0 DMC0_bit.no7
#define DWAIT1 DMC1_bit.no4
#define DS1 DMC1_bit.no5
#define DRS1 DMC1_bit.no6
#define STG1 DMC1_bit.no7
#define DST0 DRC0_bit.no0
#define DEN0 DRC0_bit.no7
#define DST1 DRC1_bit.no0
#define DEN1 DRC1_bit.no7
#define TKBIF2 IF2_bit.no0
#define TMIF04 IF2_bit.no1
#define TMIF05 IF2_bit.no2
#define PIF6 IF2_bit.no3
#define PIF7 IF2_bit.no4
#define LCDIF0 IF2_bit.no5
#define CMPIF0 IF2_bit.no6
#define CMPIF1 IF2_bit.no7
#define TMIF06 IF2H_bit.no0
#define TMIF07 IF2H_bit.no1
#define SREIF3 IF2H_bit.no4
#define MDIF IF2H_bit.no5
#define FLIF IF2H_bit.no7
#define DMAIF2 IF3_bit.no0
#define DMAIF3 IF3_bit.no1
#define TKBMK2 MK2_bit.no0
#define TMMK04 MK2_bit.no1
#define TMMK05 MK2_bit.no2
#define PMK6 MK2_bit.no3
#define PMK7 MK2_bit.no4
#define LCDMK0 MK2_bit.no5
#define CMPMK0 MK2_bit.no6
#define CMPMK1 MK2_bit.no7
#define TMMK06 MK2H_bit.no0
#define TMMK07 MK2H_bit.no1
#define SREMK3 MK2H_bit.no4
#define MDMK MK2H_bit.no5
#define FLMK MK2H_bit.no7
#define DMAMK2 MK3_bit.no0
#define DMAMK3 MK3_bit.no1
#define TKBPR02 PR02_bit.no0
#define TMPR004 PR02_bit.no1
#define TMPR005 PR02_bit.no2
#define PPR06 PR02_bit.no3
#define PPR07 PR02_bit.no4
#define LCDPR00 PR02_bit.no5
#define CMPPR00 PR02_bit.no6
#define CMPPR01 PR02_bit.no7
#define TPR006 PR02H_bit.no0
#define TPR007 PR02H_bit.no1
#define SREPR03 PR02H_bit.no4
#define MDPR0 PR02H_bit.no5
#define FLPR0 PR02H_bit.no7
#define DMAPR02 PR03_bit.no0
#define DMAPR03 PR03_bit.no1
#define TKBPR12 PR12_bit.no0
#define TMPR104 PR12_bit.no1
#define TMPR105 PR12_bit.no2
#define PPR16 PR12_bit.no3
#define PPR17 PR12_bit.no4
#define LCDPR10 PR12_bit.no5
#define CMPPR10 PR12_bit.no6
#define CMPPR11 PR12_bit.no7
#define TPR106 PR12H_bit.no0
#define TPR107 PR12H_bit.no1
#define SREPR13 PR12H_bit.no4
#define MDPR1 PR12H_bit.no5
#define FLPR1 PR12H_bit.no7
#define DMAPR12 PR13_bit.no0
#define DMAPR13 PR13_bit.no1
#define WDTIIF IF0_bit.no0
#define LVIIF IF0_bit.no1
#define PIF0 IF0_bit.no2
#define PIF1 IF0_bit.no3
#define PIF2 IF0_bit.no4
#define PIF3 IF0_bit.no5
#define PIF4 IF0_bit.no6
#define PIF5 IF0_bit.no7
#define STIF2 IF0H_bit.no0
#define SRIF2 IF0H_bit.no1
#define SREIF2 IF0H_bit.no2
#define DMAIF0 IF0H_bit.no3
#define DMAIF1 IF0H_bit.no4
#define CSIIF00 IF0H_bit.no5
#define IICIF00 IF0H_bit.no5
#define STIF0 IF0H_bit.no5
#define TMIF00 IF0H_bit.no6
#define SRIF0 IF0H_bit.no7
#define SREIF0 IF1_bit.no0
#define TMIF01H IF1_bit.no0
#define CSIIF10 IF1_bit.no1
#define IICIF10 IF1_bit.no1
#define STIF1 IF1_bit.no1
#define SRIF1 IF1_bit.no2
#define SREIF1 IF1_bit.no3
#define TMIF03H IF1_bit.no3
#define IICAIF0 IF1_bit.no4
#define RTITIF IF1_bit.no5
#define TMIF01 IF1_bit.no7
#define TMIF02 IF1H_bit.no0
#define TMIF03 IF1H_bit.no1
#define ADIF IF1H_bit.no2
#define RTCIF IF1H_bit.no3
#define TMKAIF IF1H_bit.no4
#define KRIF IF1H_bit.no5
#define STIF3 IF1H_bit.no6
#define SRIF3 IF1H_bit.no7
#define WDTIMK MK0_bit.no0
#define LVIMK MK0_bit.no1
#define PMK0 MK0_bit.no2
#define PMK1 MK0_bit.no3
#define PMK2 MK0_bit.no4
#define PMK3 MK0_bit.no5
#define PMK4 MK0_bit.no6
#define PMK5 MK0_bit.no7
#define STMK2 MK0H_bit.no0
#define SRMK2 MK0H_bit.no1
#define SREMK2 MK0H_bit.no2
#define DMAMK0 MK0H_bit.no3
#define DMAMK1 MK0H_bit.no4
#define CSIMK00 MK0H_bit.no5
#define IICMK00 MK0H_bit.no5
#define STMK0 MK0H_bit.no5
#define TMMK00 MK0H_bit.no6
#define SRMK0 MK0H_bit.no7
#define SREMK0 MK1_bit.no0
#define TMMK01H MK1_bit.no0
#define CSIMK10 MK1_bit.no1
#define IICMK10 MK1_bit.no1
#define STMK1 MK1_bit.no1
#define SRMK1 MK1_bit.no2
#define SREMK1 MK1_bit.no3
#define TMMK03H MK1_bit.no3
#define IICAMK0 MK1_bit.no4
#define RTITMK MK1_bit.no5
#define TMMK01 MK1_bit.no7
#define TMMK02 MK1H_bit.no0
#define TMMK03 MK1H_bit.no1
#define ADMK MK1H_bit.no2
#define RTCMK MK1H_bit.no3
#define TMKAMK MK1H_bit.no4
#define KRMK MK1H_bit.no5
#define STMK3 MK1H_bit.no6
#define SRMK3 MK1H_bit.no7
#define WDTIPR0 PR00_bit.no0
#define LVIPR0 PR00_bit.no1
#define PPR00 PR00_bit.no2
#define PPR01 PR00_bit.no3
#define PPR02 PR00_bit.no4
#define PPR03 PR00_bit.no5
#define PPR04 PR00_bit.no6
#define PPR05 PR00_bit.no7
#define STPR02 PR00H_bit.no0
#define SRPR02 PR00H_bit.no1
#define SREPR02 PR00H_bit.no2
#define DMAPR00 PR00H_bit.no3
#define DMAPR01 PR00H_bit.no4
#define CSIPR000 PR00H_bit.no5
#define IICPR000 PR00H_bit.no5
#define STPR00 PR00H_bit.no5
#define TMPR000 PR00H_bit.no6
#define SRPR00 PR00H_bit.no7
#define SREPR00 PR01_bit.no0
#define TMPR001H PR01_bit.no0
#define CSIPR010 PR01_bit.no1
#define IICPR010 PR01_bit.no1
#define STPR01 PR01_bit.no1
#define SRPR01 PR01_bit.no2
#define SREPR01 PR01_bit.no3
#define TMPR003H PR01_bit.no3
#define IICAPR00 PR01_bit.no4
#define RTITPR0 PR01_bit.no5
#define TMPR001 PR01_bit.no7
#define TMPR002 PR01H_bit.no0
#define TMPR003 PR01H_bit.no1
#define ADPR0 PR01H_bit.no2
#define RTCPR0 PR01H_bit.no3
#define TMKAPR0 PR01H_bit.no4
#define KRPR0 PR01H_bit.no5
#define STPR03 PR01H_bit.no6
#define SRPR03 PR01H_bit.no7
#define WDTIPR1 PR10_bit.no0
#define LVIPR1 PR10_bit.no1
#define PPR10 PR10_bit.no2
#define PPR11 PR10_bit.no3
#define PPR12 PR10_bit.no4
#define PPR13 PR10_bit.no5
#define PPR14 PR10_bit.no6
#define PPR15 PR10_bit.no7
#define STPR12 PR10H_bit.no0
#define SRPR12 PR10H_bit.no1
#define SREPR12 PR10H_bit.no2
#define DMAPR10 PR10H_bit.no3
#define DMAPR11 PR10H_bit.no4
#define CSIPR100 PR10H_bit.no5
#define IICPR100 PR10H_bit.no5
#define STPR10 PR10H_bit.no5
#define TMPR100 PR10H_bit.no6
#define SRPR10 PR10H_bit.no7
#define SREPR10 PR11_bit.no0
#define TMPR101H PR11_bit.no0
#define CSIPR110 PR11_bit.no1
#define IICPR110 PR11_bit.no1
#define STPR11 PR11_bit.no1
#define SRPR11 PR11_bit.no2
#define SREPR11 PR11_bit.no3
#define TMPR103H PR11_bit.no3
#define IICAPR10 PR11_bit.no4
#define RTITPR1 PR11_bit.no5
#define TMPR101 PR11_bit.no7
#define TMPR102 PR11H_bit.no0
#define TMPR103 PR11H_bit.no1
#define ADPR1 PR11H_bit.no2
#define RTCPR1 PR11H_bit.no3
#define TMKAPR1 PR11H_bit.no4
#define KRPR1 PR11H_bit.no5
#define STPR13 PR11H_bit.no6
#define SRPR13 PR11H_bit.no7
#define MAA PMC_bit.no0

